<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 6 changes.</summary>

```diff
! module.ubuntu22.proxmox_virtual_environment_vm.vm is tainted, so must be replaced
+ module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
! module.vm_minimal_config.terraform_data.combined_ci_hash will be updated in-place
+ module.vm_minimal_config.terraform_data.creation_date will be created
+ module.vm_minimal_config.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0] will be created
+ module.vm_minimal_config.module.cloud_init_files[0].random_id.random_id will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 5 to add, 1 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-15T04:16:35Z [(view log)](https://github.com/perchnet/p/actions/runs/16982805518/job/48146375492#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ubuntu22.proxmox_virtual_environment_vm.vm is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "8022" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:D5:DE:DB",
        ] -> (known after apply)
        name                    = "ubuntu22"
      ~ network_interface_names = [] -> (known after apply)
      ~ tags                    = [
          - "template",
            "terraform",
          + "template",
            "ubuntu",
        ]
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "base-8022-disk-0" -> (known after apply)
          ~ size              = 20 -> 8
            # (13 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:D5:DE:DB" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = (known after apply)
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "vm-ubuntu22-minimal"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "pve1"
          + retries   = 1
          + vm_id     = (known after apply)
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + initialization {
          + datastore_id         = (sensitive value)
          + interface            = (sensitive value)
          + meta_data_file_id    = (sensitive value)
          + network_data_file_id = (sensitive value)
          + type                 = (sensitive value)
          + user_data_file_id    = (sensitive value)
          + vendor_data_file_id  = (sensitive value)
        }

      + memory {
          + dedicated      = 1024
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.vm_minimal_config.terraform_data.combined_ci_hash will be updated in-place
  ~ resource "terraform_data" "combined_ci_hash" {
        id     = "5b2a8efd-c574-64c5-576f-a072826271ae"
      ~ input  = {
          ~ hash = (sensitive value)
        }
      ~ output = {
          - hash = "295d29"
        } -> (known after apply)
    }

  # module.vm_minimal_config.terraform_data.creation_date will be created
  + resource "terraform_data" "creation_date" {
      + id     = (known after apply)
      + input  = {
          + timestamp = (known after apply)
        }
      + output = (known after apply)
    }

  # module.vm_minimal_config.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0] will be created
  + resource "proxmox_virtual_environment_file" "ci_user_data" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = (known after apply)
          + resize    = 0
        }
    }

  # module.vm_minimal_config.module.cloud_init_files[0].random_id.random_id will be created
  + resource "random_id" "random_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "combined_ci_hash"                    = "d4ad9e"
          + "short_ci_meta_data_contents_hash"    = "0"
          + "short_ci_network_data_contents_hash" = "0"
          + "short_ci_user_data_contents_hash"    = "QgTWdM"
          + "short_ci_vendor_data_contents_hash"  = "0"
        }
    }

Plan: 5 to add, 1 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-56-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->